---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingLength
source: html/1c41757e-dee0-4b98-55be-beb5c1357879.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrNosingLength Property

"Nosing Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrNosingLength { get; }
```